the
of
given
return
a
and
is
in
an
to
that
are
you
if
integer
array
number
where
with
be
it
each
can
all
for
n
1
from
two
or
any
there
one
0
at
by
not
string
such
as
integers
order
have
on
example
length
following
-
nums
i
same
no
x
has
this
will
only
0-indexed
minimum
may
note
2
maximum
after
value
answer
ith
k
sum
find
than
equal
possible
some
s
which
elements
its
between
then
must
true
first
binary
every
should
also
otherwise
we
more
characters
positive
so
into
left
-1
strings
3
represents
list
right
exactly
values
false
element
make
other
m
time
nodes
ie
tree
index
most
them
2d
contains
times
numbers
size
both
empty
least
int
your
row
different
they
j
valid
node
sequence
representing
their
letters
multiple
choose
exists
words
when
b
result
character
either
count
7
operation
unique
root
arrays
column
does
write
matrix
sorted
distinct
do
smallest
another
once
move
represented
query
total
consists
consisting
non-empty
type
operations
adjacent
want
three
cannot
digits
indices
grid
range
using
position
key
class
implement
format
within
initially
large
returns
since
numsi
contiguous
109
largest
less
indicates
without
modulo
name
starting
path
these
4
arr
new
last
next
5
ii
but
lowercase
considered
need
set
defined
start
contain
table
containing
remove
target
before
c
greater
initializes
even
pair
generated
object
substring
form
denotes
inclusive
second
cell
get
end
subarray
above
word
single
letter
consecutive
difference
guaranteed
original
remaining
up
primary
y
numbered
schema
sql
take
english
longest
means
called
function
until
edges
allowed
add
test
rules
input
respectively
edge
use
design
game
reach
digit
conditions
pairs
connected
strictly
change
cells
id
non-negative
moves
current
product
point
labeled
cases
score
subsequence
always
four
zero
needed
points
while
distance
group
check
however
leading
step
steps
deleting
starts
follows
amount
could
space
assume
case
was
top
perform
answers
void
exist
6
because
appear
positions
replace
very
day
numsj
down
formed
used
graph
square
data
whose
ways
ai
possibly
way
who
1s
formally
10
represent
answeri
rows
queries
9
increasing
t
changing
nums1
num
bi
ascending
substrings
many
notice
would
varchar
person
zeros
pick
present
algorithm
absolute
xi
becomes
jth
returned
delete
resulting
ends
takes
linked
edgesi
structure
search
d
odd
through
smaller
part
0s
appears
final
below
determine
subarrays
head
required
undirected
numslength
r
impossible
common
itself
nums2
lexicographically
output
previous
removing
turn
cost
place
line
corresponding
swap
about
shortest
split
been
children
task
solution
non-decreasing
8
null
yi
moving
still
including
how
direction
good
val
complete
performing
representation
directly
consider
price
process
made
according
arri
like
among
height
alice
let
separated
convert
equals
maximize
whether
report
information
types
none
palindrome
32-bit
people
chosen
sort
call
initial
divisible
along
bottom
groups
out
accepted
permutation
too
reverse
ordered
average
problem
z
decimal
go
kth
become
already
----------------------
removed
spaces
except
prefix
divide
alphabet
apply
optimally
placed
highest
p
city
occurs
satisfies
boolean
level
ones
subsequences
coordinates
color
obtained
infinite
paths
applying
being
occurrence
duplicate
insert
goal
lower
uppercase
shown
1-indexed
over
actual
define
construct
board
bob
plane
negative
area
child
bitwise
code
were
leaf
duplicates
long
play
lengths
abc
days
date
queriesi
playing
ab
occurrences
l
wants
traversal
written
turns
trees
obtain
currently
parent
si
water
repeat
pass
entire
special
columns
minutes
parentheses
added
system
concatenation
simultaneously
those
player
derived
subset
during
minimize
bits
necessarily
u
fit
travel
together
xor
outside
beginning
iii
back
complexity
solve
players
side
unit
o
e
frequency
corner
relative
squares
know
never
ans
forward
calculate
lists
keys
seconds
subtree
rearrange
money
user
lowest
100
employee
partition
closest
interval
described
connecting
correct
instead
10-5
tie
build
create
flip
calls
stones
visited
choosing
select
put
needs
suppose
greatest
visit
said
adding
see
directions
extra
customer
based
arranged
twice
just
assigned
addition
inside
width
satisfy
constraints
vertical
bottom-right
per
east
concatenated
consist
replacing
rectangle
expression
taken
s1
s2
divided
stone
third
built-in
results
receive
bst
larger
endi
starti
mat
follow
max
upper
top-left
vi
adds
he
text
under
random
full
11
repeated
changed
again
invalid
found
front
functions
describes
circular
bit
nth
merge
road
signed
ids
prices
map
names
------------------------
item
rotate
leftmost
coordinate
location
followed
ansi
stop
located
assign
standing
mentioned
achieve
denoting
n-1
divisor
denote
sums
append
match
state
meaning
exceed
units
employees
rounded
several
power
horizontal
ui
prime
student
students
arr1
1st
filled
v
buy
best
maximized
done
certain
occur
nums0
colors
please
include
immediately
backward
col
land
wordsi
pointsi
repeating
passed
continue
fewer
sentence
condition
minimized
subtract
middle
places
arrlength
run
method
sequences
available
west
removes
numsk
longer
nums1i
increment
division
weight
gets
clockwise
intervals
finish
trailing
keep
costs
vertically
friends
wall
items
x-axis
palindromic
floor
calculated
reads
rearranging
building
arrj
pattern
might
similarly
non-overlapping
limit
south
north
4-directionally
modify
destination
minute
scores
increase
diagonal
dictionary
round
deleted
rest
box
123
differ
users
seats
foreign
friend
nearest
-----------------------
win
runs
stops
directed
network
his
walk
encoded
ending
additional
continuous
reaches
properties
concatenating
customers
jump
counted
transform
assuming
fits
replaced
store
wins
depth
iv
vertices
specific
flips
ri
rotation
12
making
sign
zeroes
alternating
moment
going
swaps
horizontally
around
belongs
cover
higher
having
sell
examples
robot
room
cities
print
constructed
file
arr0
2nd
x1
similar
rightmost
inserts
inserted
h
salary
asked
well
rule
neighbors
queue
modified
leaves
plus
circle
f
2n
permutations
share
rooted
off
rectangular
orders
products
pile
rotated
w
blue
white
red
begin
suffix
stream
meets
break
company
3rd
pointer
speed
remains
supports
randomly
version
matches
hold
placing
due
25
onto
stack
winner
created
singly
our
denoted
seat
-------------------
pay
base
ordering
program
constant
intersection
event
events
additionally
fn
specifically
now
subtrees
wait
work
subsets
solutions
leave
o1
played
performed
probability
inputs
belong
cycles
word1
word2
dollars
userid
pricei
stock
etc
piles
instance
colored
transactions
high
center
x-y
bidirectional
car
matching
x2
13
collect
lexicographical
1000
distribute
sorting
identical
insertion
covered
had
holds
earliest
profit
26
shows
lefti
leetcode
combination
degrees
-x
later
applied
non-zero
decide
much
uses
beautiful
double
arithmetic
boxes
what
implementation
latest
year
frequent
completely
gridij
period
coins
stay
requirements
manager
changes
low
rank
pricesi
makes
piece
mark
satisfied
indicating
started
counts
parallel
0th
meet
traveling
request
language
num1
num2
included
serialization
generate
read
arbitrary
a2
support
capacity
push
top-right
course
taking
reversed
segment
image
heights
balanced
hour
decided
operator
free
candies
evaluate
decrease
decreasing
overlapping
anywhere
sets
bool
vowels
update
she
arrive
rounds
righti
nothing
open
triplets
tasks
house
swapping
say
five
reorder
15
nums2i
remain
maximal
timei
reachable
subsequent
island
vowel
numsi1
overlap
bank
received
obstacle
across
pieces
cut
andor
come
hours
axis-aligned
chessboard
roads
factors
divides
y1
radius
block
tasked
reconstruct
preorder
recall
queriesj
fromi
toi
sides
bottom-left
rectangles
answerlength
pop
ranges
manner
slength
segments
expressions
evaluates
concatenate
abcde
fixed
mapping
labels
parts
multiply
finding
weights
source
231
brackets
multiplication
90
arr2
equivalent
intervalsi
comes
running
01
accepts
card
associated
help
series
finally
rotating
vertex
cycle
replacement
combinations
message
lets
stored
rearranged
versa
vice
houses
a1
memory
decode
perfect
enum
give
did
surrounded
productid
sold
choice
checks
formatted
hand
removal
balls
g
shape
broken
picked
doing
black
country
descending
requests
factor
forms
4th
reduce
record
team
arrarrlength
20
querieslength
thus
far
pushes
excluding
mean
strs
deletions
deletion
separate
cardinal
chooses
draw
disjoint
courses
grouped
indicate
own
provided
logs
nums2j
half
notes
future
ancestor
in-place
judge
significant
earlier
anagram
others
label
stonesi
increments
divisors
c1
able
garden
kind
cards
street
boundary
splitting
321
21
world
modifying
themselves
exam
removals
ignored
inserting
enter
ensure
particular
copy
alices
figure
indexed
converted
limited
olog
previously
explanation
amongst
missing
absx
satisfying
regardless
fully
contained
flipping
triangle
descendant
intersect
costi
happens
abcd
earn
drop
-3
affect
timestamp
threshold
puzzle
rating
online
diagonally
lead
reports
ball
obstacles
hi
towards
met
reached
subtraction
finished
addint
q
reference
definition
testcases
here
stores
y2
centered
independent
public
cols
us
collection
whole
nodeval
22
encoding
exact
generates
bag
equally
evenly
connection
opposite
food
built
neighboring
sequentially
partitioning
small
absi
sit
lines
endpoints
trip
counting
optimal
parents
custom
forming
toward
increases
weighted
descendants
loses
symbol
candy
transaction
ci
selected
palindromes
wikipedia
eat
allow
differences
101
23
lose
analysis
closed
waiting
tasksi
alternate
visits
1th
operators
movement
phone
happy
worker
workers
completed
minimal
simple
roots
job
non-increasing
hhmm
lie
necessary
passes
li
answer1
answer0
real
content
composed
trying
goes
jumps
30
nor
repeatedly
runtime
individually
underlined
fourth
idi
perimeter
doesnt
varying
pilesi
occupied
age
employeeid
access
methods
shorter
criteria
shop
wi
shapes
tokens
partitions
132
leaving
outgoing
walls
website
persons
social
video
server
procedure
huge
multiplied
constructor
converting
coin
buildings
median
aa
works
differs
nice
nested
1234
chose
pushint
department
existing
positioned
computed
returning
station
sitting
mod
continues
moved
falls
gain
shift
fall
her
rooms
anagrams
distances
variable
allocate
printed
chunk
evaluation
parenthesis
triplet
partitioned
straight
pivot
unknown
traverse
field
c2
log
numeric
cars
locations
allows
property
transformation
arrival
reset
permi
perm
plant
walking
enough
writing
connects
quantity
else
teams
vj
uj
wrong
interpreted
compute
arrange
treat
secret
threads
counterclockwise
away
address
shares
marked
valuesi
neither
60
weighti
50
104
0000
00
ace
positioni
linear
computer
indirectly
16
painted
facing
automatically
-------------------------
tile
pairsi
frequencies
fill
blocks
sentences
merged
border
arrives
appended
answerj
r1
infinitely
x-coordinate
passengers
languages
2s
complement
internal
blocked
restaurant
simplicity
daily
booking
restrictions
compare
equation
yj
calendar
yellow
causes
green
accounts
balance
further
freely
determined
selling
token
disturbing
instructions
preceding
y-axis
detect
meeting
capital
roadsi
direct
media
send
05
formula
produce
various
proven
month
reformat
quality
serialized
local
mountain
updates
alphanumeric
phrase
rolls
dice
roll
die
regular
partial
root-to-leaf
keeping
bags
iterator
--
question
falling
solutionint
likely
window
sliding
diff
hello
percentage
customerid
prerequisites
arrangement
supply
islands
symbols
provide
consecutively
nums1length
mapped
container
heighti
downward
standard
resultant
kinds
overall
sale
arguments
numsn
successful
expected
face
competition
train
flowers
planted
named
filling
rowi
magic
allocated
chunks
simplified
-231
intermediate
calculator
opening
conversion
apple
forever
repeats
email
emails
collected
attack
diagonals
unless
visiting
components
dot
alphabetically
corresponds
sub
parameter
calling
xth
fibonacci
trips
duration
milliseconds
lost
unfortunately
maps
beauty
coming
sj
bus
outer
entries
happen
arrk
k-th
tests
zigzag
spend
school
recursively
messages
sent
i1th
bi-directional
thread
typed
handle
sub-arrays
environment
periods
ladder
cuts
24-hour
shifting
candidates
games
instances
matter
alphabetical
slices
010
super
sizes
specified
stand
beyond
servers
idle
library
frog
levels
19
attend
logsi
40
pi
api
describe
crossing
cross
tiles
paint
ranks
guess
inclusively
robots
neighbor
unlock
endpoint
security
office
schedule
gives
calculation
14
slots
fair
cause
includes
unable
rearrangement
disconnected
decoded
executed
activity
keyboard
y-coordinate
parenti
bc
passenger
picking
therefore
login
--------------------------
distancei
counter
orderdate
productname
reversing
constraint
xj
undefined
clear
account
amounts
calculates
unsorted
interested
wordsj
135
execution
startpos
begins
connect
star
starttime
endtimei
starttimei
endtime
treated
i-th
float
numi
themself
knows
files
look
continuously
title
tower
integral
euclidean
speedi
banned
cant
origin
solving
two-dimensional
section
attributes
besides
signifies
refer
receives
checker
indexing
quantities
spell
net
17
compressed
generator
insertint
encode
records
domino
inorder
recursive
yields
gcd
234
remember
constructs
strange
appeared
immediate
relationship
grow
belonging
engage
topmost
applies
diagram
stations
stick
valsi
seq
him
numsl
shuffled
ties
reaching
lands
tallest
dropped
sk
nesting
shifts
visible
anything
hasnext
clock
deletes
questions
gap
separating
decreases
entering
occurring
0-9
assigning
coli
resulti
knight
acb
hamming
turned
status
tickets
degree
usual
ignoring
basket
baskets
triple
rain
b2
composition
denominations
-2
flatten
distribution
considering
discount
queens
paper
eating
restricted
interface
searchword
initialized
market
root2
root1
acyclic
xy-plane
balloons
arrows
balloon
keeps
f1
recover
dashes
kilometers
key-value
getting
factorial
eats
dots
happened
recent
splits
flower
routes
route
travels
details
legal
sales
appending
eight
nine
project
mini
jumping
session
erasing
better
display
via
indicesi
postorder
numsnumslength
error
numsleft
numsright
self
strength
component
journey
possibilities
expansion
jobs
a0
view
averages
minus
pointers
nums2length
buffer
pathsi
nums3
floors
labelled
2359
trivially
wrapping
distributed
mathematical
paired
tournament
peak
aj
colorsi
respective
main
statement
script
fraction
aforementioned
submatrices
working
0100
avoid
hidden
appends
actually
passing
processed
domain
leetcodecom
spiral
whenever
attended
folder
picks
getint
simply
seven
27
500
p1
unlimited
resolve
ten
non-space
actions
river
boundaries
011
s3
rectanglesi
ranking
xs
finds
numerical
known
dates
compared
night
rob
robber
wordslength
rate
paid
bad
ever
gridrc
001
decrement
desired
valuei
ability
causing
unoccupied
ugly
planning
painting
skip
try
repetition
shuffle
bobs
representations
track
arr1i
arr2j
everyone
my
dist
instantaneously
command
ended
ratio
validate
collide
connections
nary-tree
n-ary
n2
summation
furthermore
infected
min
participating
configuration
assignment
rotations
close
ki
crosses
machine
counter-clockwise
finishes
bounds
bar
r2
abcc
dollar
drive
ride
driving
parity
unsigned
32
notation
2020
solved
occupy
filter
seatsi
flight
dont
---------------------------
managers
yyyy-mm-dd
summary
xn
ranked
cutting
cd
marks
12345
matij
instruction
staying
startrow
execute
worked
eventually
corners
liters
fuel
spreading
res
movie
movies
videos
guarantee
directory
bitwise-xor
pref
mm
signal
1d
2-dimensional
commas
serialize
respect
photo
row1
col1
row2
col2
password
i0
individual
entirely
run-length
marking
simulation
tells
iterates
genetic
choices
assumed
stays
force
pushed
dominoes
lexicographic
bef
forgot
stacks
sometimes
departmentid
departments
list2
list1
delivery
preferred
scheduled
relations
prerequisite
non-intersecting
ingredients
viewed
comprises
pyramid
plots
covers
plot
reminder
aba
boardrc
link
chars
vals
numsr
majority
objective
subgraph
positionsi
aligned
depending
deque
implemented
normal
simulate
double-ended
subjected
colori
itemsi
heightsi
offers
hands
expectednumsi
assert
assertions
expectednumslength
expectednums
pairings
experience
violating
quadruplets
1-9
t1
t2
existed
redundant
bricks
erase
dies
enters
captured
312
cab
press
merging
members
member
variables
multiplicity
unary
coefficient
terms
basic
closing
touches
magical
few
bounded
1101
flattened
judged
numsk-1
monotone
giving
forest
3sum
updated
queen
buckets
feed
favorite
eaten
formats
-9
callback
arrleftright
primes
contest
obtaining
lucky
activities
decrypt
matrices
context
logged
swapped
drives
elapsed
cache
fx
guards
delay
delayed
effect
subgrid
planting
past
teacher
importance
bloom
buses
checked
val1
val2
--------------------
a3
xored
destroyed
salaries
income
reading
precedence
peoplei
determines
asks
finishing
selecting
ancestors
apples
frequently
tweets
tweet
retrieves
listinteger
denominator
pos
contrast
backwards
pressed
blank
unrooted
customersi
owner
tuples
left-to-right
height-balanced
pointing
elevation
volume
lies
64-bit
profiti
ranging
nobody
ip
managerid
shuffling
an-1
alength
startvalue
fractional
truncate
losing
dividing
axes
xy
chain
listed
sticks
exceeds
inputoutput
distributions
behind
wordlist
reuse
wish
xi1
59
catch
odd-indexed
even-indexed
live
poor
ring
principle
edgesj
designed
adjacency
testing
show
temperature
fifth
submatrix
afterward
getrandom
factory
vice-versa
non
graphi
graphij
restriction
deserialize
deserialized
pays
len
gridm
grid00
1n
0-based
arriving
plants
6-sided
weightsi
manhattan
filetxt
reordered
eventsi
calculations
absnumsi
putint
numerals
six
ix
nums1j
p2
successive
255
restore
addresses
2-d
independently
escape
info
drawing
widths
imagine
comprise
collisions
collision
di
touching
sn
aec
bought
whereas
well-formed
region
regions
vali
5th
dead
str1
str2
alerting
police
contact
short
singly-linked
bracket
tell
reduces
accept
wide
75
arrangements
bsts
traveled
aaa
locked
unlocks
upper-case
contents
cpu
difficulty
typically
movements
stashed
aab
whitespace
gridrowcol
correspond
uncolored
indexi
chess
timesi
rangesi
handling
28
meetings
completes
targetsum
non-leaf
buying
implementing
k-1
arrivali
successfully
partially
maximizes
i1
holding
big
deepest
throws
placement
gcdx
bookint
half-open
dimensions
climb
obstaclesi
numcourses
prerequisitesi
candiesi
flipped
uniquely
cj
lying
24
connectionsi
critical
fnarri
conflict
34
hash
spread
uncommon
staircase
unchanged
requires
enhances
disti
sequential
exchange
costsi
hire
sub-array
years
shared
warehouse
mouse
occupies
in-order
parser
lock
held
s0
fruits
structurally
amounti
folders
matrixs
someday
upcoming
device
preparing
action
though
libraries
alternately
sheet
excel
110
1-based
lodashs
attain
valued
loss
06
evaluating
pickup
parentsi
105
arr1length
targety
targetx
finite
parent0
options
rides
taxi
compiler
java
datetime
filtering
restaurants
ratingi
maxdistance
collects
nextint
stocks
firsti
reserved
flights
lakes
february
companys
partner
leads
3n
stamps
stamping
fs
reporting
pointslength
transferred
10000
involving
powx
punctuation
a-b
redistribute
executing
startcol
node2
node1
countint
mirror
laser
liter
relationships
subordinates
news
layout
odd-numbered
cinema
appropriate
agesi
sends
ages
optionally
h2o
communicate
tab
directories
filedirectory
extension
diameter
capitalization
creating
non-null
comma-separated
speeds
efficiency
performance
engineer
gold
mine
collecting
isleaf
sub-grid
topleft
terminator
sub-grids
topright
bottomright
quad-tree
proper
bottomleft
wiki
recurse
strong
weak
throughout
requestsi
reside
transfer
transfers
strongest
-7
compression
compress
ccc
treenode
chunked
decomposition
mutate
dominoesi
multi-dimensional
2510
121241510
abcdefuvwxyz
vyz
realized
bishops
bishop
attacking
rooks
capture
rook
costij
applications
eee
hit
printer
groupsi
i-1th
specify
--------------------------------------
sensitive
faces
proved
definitely
situation
answerx
views
article
bridge
farmland
inverse
stationsi
numsl1
numsr-1
345
halve
reduced
drawn
tx
sx
ty
sy
graphs
landing
leftright
dropping
natively
peekpop
supported
peek
fifo
selection
typei
everybody
speciali
shopping
cousins
numerically
angle
rear
isfull
isempty
things
important
yes
1001
surface
cubes
3d
opponents
training
energy
differing
numsa
numsb
numsd
numsc
mid
sub-boxes
sudoku
k-sum
modifications
erasure
erased
brick
hits
disappear
rightward
drops
upon
knights
guarded
absent
attendance
late
award
eligible
service
sourcei
targeti
bulb
switcher
button
presses
buttons
bulbs
decrements
programming
picky
book
evaluated
term
2x
bac
pig
lot
borders
sea
obeys
performs
stands
anti-clockwise
tested
initialize
numsk1
numsn-1
natural
223
scoresi
answersi
matrixrowcol
king
sij
patterns
bucket
fed
published
researchers
h-index
cited
researcher
papers
citationsi
citations
optional
queryint
searchstring
108
replaces
flat
bursting
shot
burst
arrow
restrictionsi
bomb
decrypted
treesi
rope
startj
replacements
const
shifta
bonus
fn-1
f2
separation
deck
decki
single-space
bs
tripsi
expiration
f3
gone
likes
convenience
defines
enemy
gardens
flowersi
incomplete
frame
party
skipped
smart
vote
strategy
predict
ij
e1
concept
v2
innermost
protected
v1
parse
e2
cups
cup
liquid
quarter
glass
saleid
describing
extract
smash
category
categories
monthly
yet
quote
effective
interfere
skills
skill
maxi
personid
exceeding
0110
grammar
referred
sessions
self-edges
computing
chalkboard
fulfilled
numrows
f0
university
dag
truck
metal
instructed
mode
tweetid
post
followerid
exclusive
internally
tails
targets
subject
subjects
index2
index1
210
012
loop
puts
completing
ignore
digitsi
divisions
unrevealed
mines
revealed
coinsi
tuple
requirement
brings
traffic
console
printnumber
prints
trapping
raining
trap
union
cartesian
rx
rotten
doctors
warm
youre
scheduling
immutable
parsed
sections
ipv4
invert
growing
addnumint
transformed
doubled
projects
resources
0124567
4567012
an-2
originally
distributing
iteration
4sum
viewing
x3
rowj
ansj
colj
gridrowicoli
transactionsi
deep
copied
refers
slashes
slash
k1
k2
matched
wordlength
endword
beginword
relation
plate
wiggle
expressed
unbroken
eggs
certainty
egg
breaks
wooden
xi2
hh
maxsize
shiftsi
boxesi
miles
one-lane
ahead
faster
fleet
multiples
words1
words2
equations
equationsi
ratings
richest
a4
eval
allotted
freq
nums2i1
advance
advances
identify
truncates
ant
encodedi
bj
computers
processes
totally
page
clone
cloned
listnode
slowest
newly
supposed
driver
abcdefghijklmnopqrstuvwxyz
temperatures
increased
signs
preserved
lcm
worth
parameters
removeint
-5
fancy
infinity
1010
insertstring
sumrangeint
numarray
numarrayint
sub-tree
appearing
triples
transmitted
serializationdeserialization
reconstructed
bill
divisibility
backspace
gridi
objects
arrived
processing
reply
master
instantly
installed
rollsi
port
load
package
packages
ship
frogs
mixed
x0
rational
edit
permitted
bash
456
furthest
lined
memoized
cached
memoize
grids
startdayi
enddayi
invalidate
struct
populate
populating
abbreviated
molecule
maintained
recently
incremented
searches
efficient
numeral
400
xii
iiii
usually
roman
xxvii
900
xx
powers
race
fi
pairwise
unequal
shouldnt
uniform
asynchronous
stonevalue
rods
rings
19216811
02
space-separated
watering
refill
plantsi
orderid
buyerid
2019
sellerid
join
yourself
tables
optimize
resets
matrixij
install
monitor
asteroids
asteroid
empid
tiling
sure
reward
studentid
yield
timej
maxtime
awesome
cookies
correctly
took
guessed
guesses
os
respecting
summing
carries
rented
cheapest
searchint
73
6th
rising
success
strengths
tour
entrance
xcenter
overlapped
ycenter
ch
preserving
triangles
tries
pre-order
bound
tracker
worst
tracks
lca
traversed
alphabetic
foods
operates
init
floating-point
stopped
pixels
turning
bbb
120
wasted
ascii
pid
inner
roomsi
cellsi
great
lower-case
budget
single-threaded
stopping
attempt
attending
commands
movesi
tic-tac-toe
maintain
tonight
professional
consistent
s1i
non-equal
ideal
history
numsnumslength-1
repetitions
prefixes
nums0i
attempts
uniformly
summer
33
housesi
indirect
1100
images
squared
nums2i2
identifier
spent
durationi
halves
fibonacci-like
abcba
serve
someone
025
linked-lists
heads
213
promise
reject
seed
growth
2th
efficiently
coloring
solvable
prepending
80
pushing
movecost
cook
duplicated
worddict
reused
segmentation
2h
57
half-closed
sake
vii
app
ik
population
million
maze
rootval
systems
robbing
thrown
walked
tag
browser
angles
pascals
slot
coprime
save
carry
stacked
stacking
widthi
ticket
ticketsi
colsum
fashion
js
labelsi
shaped
skyline
citys
contour
safe
flood
related
potentially
cba
penalty
popped
stationary
collides
180
biginteger
forth
army
slice
pizza
235
farthest
filtered
copies
forwards
simulates
permute
carpetlen
tilesi
polygon
convex
cooldown
scheduler
b1
dash
mail
transpose
2k
xxxx
asterisks
extending
formatting
joined
retrieve
non-digit
p0
namesi
minitial
malware
prefers
studentsj
queues
preference
pj
checking
limitj
disconnect
climbing
stairs
keyi
align
dial
spelling
express
jsonparse
fee
minimums
eliminate
elimination
identified
orange
oranges
url
bijection
intersections
cheese
waste
installing
spreads
uninfected
contaminated
outcome
curr
snake
ladders
lr
bars
cat
seqlength
seqi
birth
death
0190
locks
meetingsi
unused
departure
departs
4237214
274
242
groupi
fruit
updateint
numsindex
entry
entered
got
safely
former
situated
latter
batch
resolved
votes
tied
extended
triangular
newnumsi
newnums
sleftirighti
pairing
song
songs
bug
converts
soldiers
weakest
covering
intersecting
reformatted
active
activitytype
spans
spanning
older
-k
mass
playerid
deviceid
eventdate
logging
gamesplayed
removeduplicatesnums
kept
maxdeptha
deptha
depthb
vpss
depths
vps
aebdc
aeb
wonderful
maxsum
biggest
45
ice
cream
blength
quotation
successor
profitable
keysi
comma
operating
wheel
ground
serving
exit
worry
waits
old
withdrawint
withdraw
depositint
deposit
routine
boy
cipher
plan
removekey
aalength
chef
0001
hexadecimal
percent
circumference
traversing
fruitsi
logical
home
fresh
1337
similarity
indexes
tank
gas
cancelled
102
si1
gains
displays
findint
afterwards
incoming
popular
doubly
n-queens
codes
trim
trimmed
classes
separately
90-degree
rests
typing
incorrect
capacities
till
produces
repaired
repair
limits
-10
monday
tuesday
sunday
ranksi
boomerang
minimizes
fizzbuzz
buzz
fizz
row-wise
cherries
cherry
excluded
attribute
kingdom
family
spellchecker
idx
parents0
foo
provides
pad
fewest
layer
cyclic
layers
piecesi
meters
recorded
acceptable
case-sensitive
arr2length
designated
linked-list
week
grouping
a-z
aajf
11106
kjf
modifies
bacd
floating
case-insensitive
machines
3x
examine
manages
verifying
downwards
18
dva
dv
ridesi
earnings
tipi
tip
willing
requesting
-1073741825
logins
side-length
crossword
filters
vegan-friendly
veganfriendly
restaurantsi
maxprice
veganfriendlyi
quotes
73412
stockspanner
span
todays
7212
today
bookings
lasti
bookingsi
corporate
horizontallyvertically
isnt
productcategory
makename
dateid
partnerid
leadid
leadids
partnerids
dailysales
partners
minnumsi
stampheight
stampwidth
fw
fqueriesi
dcce
reportsto
anyone
x-values
classs
superclass
gregorian
zuma
variation
transid
transactedon
raised
highest-ranked
pricing
wood
grain
afad
hyphens
ba-c
ab-
-ab
hyphen
preserve
executes
constrained
well-performing
non-tiring
tiring
havent
lays
querytime
homework
perpendicular
detectsquares
southwest
reflection
ray
receptor
mirrors
receptors
arrx
arry
representative
representatives
informtimei
headid
urgent
managerheadid
subordination
manageri
inform
resrc
resr1c2height-r-1
resr1c-2height-r-1
res0n-12
2height1
description
genre
boring
agex
agey
atoms
atomic
h2o2
h1o2
chemical
atom
formulas
h2o23
h2o2he3mg4
luprefixint
luprefix
uploads
uploaded
uploadint
upload
friendship
transitive
teach
friendships
friendshipsi
languagesi
excellent
file2ext
dirsubdir2subsubdir2file2ext
subdirectories
new-line
subdirectory
subdir2
abstracted
subsubdir2
opened
subdir1
dir
subsubdir1
picture
looks
file1ext
explained
dirntsubdir1nttfile1extnttsubsubdir1ntsubdir2nttsubsubdir2ntttfile2ext
nameextension
prefi
capitalized
capitalize
30th
oct
31st
yyyy
2100
jul
sep
jun
jan
apr
dd
aug
feb
nov
1900
mar
dec
towers
qi
garbled
qualities
towersi
cy
cx
answerij
matrc
reduction
nextlargest
1-dimensional
encounter
934126
sentinel
verify
engineers
efficiencyi
maxlocalij
maxlocal
arrbannedi
bring
bannedi
orderwith
y22
x22
understand
quad
row1col1
updatesubrectangleint
rowcol
subrectangle
newvalue
getvalueint
row2col2
subrectanglequeries
non-alphanumeric
baaabb0
baaba0
answerslength
answersj
incidenta
iquerieslength-1
p123m
stickers
sticker
comprised
necesssarily
achievable
season
arrm
stronger
aabccc
a2bc3
c3
orderings
top-to-bottom
simulator
rollmax
rollmaxi
introduced
cbtinsertertreenode
cbtinserter
getroot
inserter
subtextk
subtext1
subtext2
subtexti
rocks
additionalrocks
rocksi
capacityi
380925
exhausts
exhausted
encodingi
3825
281825
rle
88855
exhaust
rleiteratorint
rleiterator
investigate
mutation
mutations
gene
endgene
8-character
aaccggta
aaccggtt
startgene
k-repeating
expends
forces
upright
fallen
purposes
yielding
encounters
rectsi
rects
gcds
4616
strsn
strs1
strs2
strs0
wrote
seperate
pawns
captures
pawn
stack-like
freqstack
size2
size1
feeling
helllllooo
stretchy
ll
hiiii
oo
hellooo
helloo
lllll
ooo
expressive
heeellooo
pins
bowling
player1
2xi
player2
list1i
list2j
customerprefdeliverydate
deliveryid
precisely
nextcoursei
relationsi
prevcoursei
semester
semesters
comparisons
searchcost
face-up
kn
ans0
ans1
third-largest
122
distinctly
second-largest
ingredientsi
supplies
recipesi
recipe
recipes
unnecessary
richeri
richer
quietness
loud
rich
quiety
quieti
logically
quiet
viewerid
articleid
articles
author
authorid
viewer
authors
viewdate
pyramids
fertile
pyramidal
apex
farmer
bottommost
barren
abs
camelcase
110100010
2-1
ababb
pqrst
board00
fghij
uvwxy
klmno
powered
sanctioned
government
pre-existing
autoincrement
matchstick
matchsticksi
matchsticks
strs00
strs01
strs0strs0length
strs10
strs1strs1length
strs11
bba
bababcba
bbabba
alex
remainder
444
mappingi
jumbled
n3
slant
addpatch
patching
patches
landed
brushing
freezes
sidelengthi
numsdivide
biker
altitude
altitudes
gaini
myqueue
numsnumsk
numsnumsnumsk
bcdea
nummoves
rulevalue
namei
rulekey
heightsj-1
minheightsi
maxheightsi1
heightsi2
heightsj
2234
deviation
1232
specialin
needsi
specialij
offer
combinationiteratorstring
combinationlength
combinationiterator
complementary
aval
bval
ologm
echo
mycirculardequeint
mycirculardeque
deletefront
getrear
getfront
insertlast
insertfront
deletelast
sortnums
removeelementnums
equaling
actuallength
compatibility
student-mentor
studentsi
mentor
mentorsj
mentors
survey
achieved
32-bits
01101
glue
irregular
opponent
experiencei
defeating
energyi
initialenergy
defeat
initialexperience
no-adjacent-flowers
flowerbed
out-of-order
python
exponent
sqrtx
solver
3x3
floored
floornumsi
unmodified
n-th
tn2
tn1
t0
tn
tn3
tribonacci
2d-array
stable
hitsi
erasures
health
quickly
power-ups
decides
princess
dungeon
fight
imprisoned
laid
threats
orbs
demons
valiant
rescue
3-digit
dfe
adc
def
ycentre
xcentre
centre
2d-map
allowedswapsi
allowedswaps
functionality
statuses
3k
x--
--x
bookmyshowint
maxrow
concert
gatherint
spectators
allocates
hence
bookmyshow
vary
hall
scatterint
ticketing
breaking
5c
alternates
aabc
3bb
-6
4a
evalvars
well-formatted
evalints
asterisk
-2aaa
-1a14
3aab
tastiness
sells
substitutions
tleft
tright
consonant
latin
goat
oatgma
made-up
ma
applema
flow
atlantic
pacific
oceans
heightsrc
ocean
therere
1221121221221121122
k-distant
wallet
assorted
priority
k-bit
-20
negabinary
-22
-23
iteratornext
iteratorhasnext
nestedlist
nestediteratorlistnestedinteger
pseudocode
nestediterator
4566701244
0124445667
monotonic
ideab
ideaa
naming
ideas
pseudo-palindromic
primefactors
targetgrid
solid
targetgridrowcol
gift
numpeople
pricesj
rabbits
rabbit
bce
cae
cnumselect
numselect
basically
stages
yking
yqueeni
ad
xking
queensi
xqueeni
skl
hamster
hamstersi
hamsters
x-matrix
candiescount
favoritedayi
favoritetypei
dailycapi
candiescounti
-01
95a54e53
-123456e789
99e25
-90e3
1e
6e-1
--6
314
e3
2e10
535e93
0089
3e7
1a
emit
dom
subscribed
referentially
subscribing
unsubscribe
nodejs
subscribe
listeners
enables
emitter
emitting
emitted
subscriptions
eventemitter
callbacks
rangefreqqueryint
rangefreqquery
builddictstring
magicdictionary
12321
wordin-1
wordjn-1
aabd
lcp
lcpij
aaca
danny
d1
remap
remapping
sneakily
weekly
remaps
326
congratulate
mittal
d2
pangram
selldate
leaf-similar
taped
y-direction
xstart
spherical
y-coordinates
stretches
xend
maxheighti
code0
defuse
coden-1
informer
fence
erect
well-fenced
enclosed
expensive
grid2
grid1
sub-island
sub-islands
divisor2
divisor1
uniquecnt1
uniquecnt2
5247
567
salad
taxrate
consolelogthe
taxcallpolyfillitem
taxprice
callpolyfill
thisitem
enhance
functioncall
tax10
appropriately
obj
totalcost
shiftx
shiftsi-1
shiftc
fn-2
10921
depth-first
dfs
streets
upper-left
preceded
1e5
mistake
cardpoints
vehicle
numpassengersi
pooling
setting
setkey
getkey
overwritten
un-expired
inaccessible
39916800
convention
f11
preimage
variance
belonged
higheri
loweri
remembers
slowly
bananas
loves
koko
bananas-per-hour
transformations
international
----
morse
24-hours
arrivaltime
delayedtime
teemo
timeseries
timeseriesi
hero
timer
poison
attacks
poisoned
ashe
reinitialize
permn
2-mirror
base-10
k-mirror
base-2
contrary
base-k
subgrids
newflowers
caretaker
enclaves
3000
ping
recentcounter
pingint
bprefix
asuffix
bsuffix
sprefix
aprefix
ssuffix
revnumsj
rev120
revx
rev123
revnumsi
averagearr
averagea
averageb
dota2
senators
announce
voting
round-based
victory
radiant
senator
rights
parties
senate
exercise
ban
dire
falses
answerkey
confuse
trues
confusion
maximizing
truefalse
answerkeyi
ts
non-obstacle
walks
4-directional
bloomdayi
bouquet
bloomday
bouquets
routesi
routes0
vn
lisp-like
lisp
syntax
expr
scopes
scope
mult
en
poured
pouring
champagne
glasses
100th
excess
pictured
this1
is2
sentence4
diffij
zerosrowi
onescolj
zeroscolj
onesrowi
secondi
r2i
artifactsi
c1i
mud
dig
artifacts
excavate
extracted
artifact
digi
buried
underneath
uncovered
c2i
r1i
rounding
grayscale
img
smoother
surrounding
50000
accountid
20000
control
comment
newline
comments
macros
implicit
reqskills
people1
people0
sufficient
people3
turn1
kilograms
turnn
personname
numsendi
numsstarti
refereeid
referee
sessiontime
12335
min2
1235
instructionsi
blueedgesj
rededges
blueedges
rededgesi
original0
originali
derivedi
multipliers0
multipliersi
multipliers1
multipliers
convertstring
paypalishiring
legibility
font
pahnaplsiigyir
quadruplet
sqrt2
arrk1
fk
arrk0
arrkn
clock-wise
grades
square-free
unidirectional
hasapplei
hasapple
traveli
trucks
garbagei
assortment
garbage
responsible
xvalue
352
math
rewarded
submitted
elementary
eg
grade
thousands
thousand
separator
scrambled
scramble
occurred
modes
followunfollow
posted
unfollowint
getnewsfeedint
unfollowing
composes
followint
followeeid
twitter
posttweetint
fractions
less-than-or-equal-to
eeecd
testcase
targetsi
sources
sourcesi
abbc
deptid
subjectid
teaches
teacherid
taught
numbersindex2
numbersindex1
numberslength
001112
0120
traversing-order
circularly
numsseqj
seq0
seqk
forwardbackward
seq1
mkaverage
mkaverageint
calculatemkaverage
addelementint
mk
insensitive
licenseplate
12c
abccdef
cbca
caaacab
comprising
transmission
pressedkeys
texting
texts
2266622
1110xxxx
n-bytes
11110xxx
byte
unicode
110xxxxx
0xxxxxxx
utf8
1-byte
-------------------------------------------------------------
bytes
utf-8
10xxxxxx
translates
octet
validation
1351315
551
clickc
char
revealing
click
minesweeper
clickr
presence
countsi
ababbc
ac
baa
abcbabcbcb
1-d
grumpy
technique
bookstore
grumpyi
pill
requiring
workersj
pills
wraps
salaryi
signals
printnumber7
zeroprintnumber
zeroevenoddint
zeroevenodd
010203040506
evenprintnumber
oddprintnumber
buddy
cbad
omit
one-to-one
typewriter
heightmap
numsinumslength
numsii
357
159
acadbcbd
brace
comma-delimited
abefh
ra
singleton
acdfh
acefg
rexpr
ek
concatenations
rabbc
rabc
rabcdefgh
abdfh
understood
acefh
abefg
re2
acdfg
re1
rabcd
abdfg
rw
grows
rot
applesi
daysi
subroot
warmed
heater
heaters
winter
nummatrix
sumregion
sumregionint
nummatrixint
numberofboxesi
trucksize
numberofunitsperboxi
boxtypes
boxtypesi
datastreamint
consecint
datastream
bobarrows
alicearrows
shoots
numarrows
archery
scoring
bk
ak
graphint
shortestpathint
addedgeint
edgecost
edgecosti
defanged
defanging
neededapples
summaryranges
seen
getintervals
summarize
zero-filled
pure
ipo
soon
profitsi
venture
capitali
arr3
arri-k
arr5
k-increasing
arr4
onlogn
removable
removablelength
sremovablei
bix
closer
incompatibilities
incompatibility
xoring
xor-beauty
8345
dealing
truncated
dividend
-27335
quotient
shadow
yz
projections
planes
looking
3-dimensional
projection
zx
cnti
xcnti-1
xcnti
subdivided
maxmoves
subdivide
dominoesj
dominoeslength
spots
valuesj
spot
sightseeing
lampsi
lamp
gridrowjcolj
illumination
lamps
answering
illuminated
illuminates
memory2crash
incremental
crashes
crashed
memory2
memory1
crashtime
leak
consumes
faulty
memory1crash
xrandom
brand
randomindex
canonical
simplify
unix-style
numsleft1
arri-1
distancethreshold
cheating
classroom
store1
store3
store2
quantityi
addword
worddictionaryaddworddad
worddictionary
searchdesign
worddictionaryaddwordbad
addwordword
baddadmadpadbadadb
worddictionaryaddwordmad
worddictionarysearchpad
worddictionarysearchbad
nullnullnullnullfalsetruetruetrue
worddictionarysearchb
worddictionaryaddwordaddwordaddwordsearchsearchsearchsearch
worddictionarysearchad
xn-1
xn-2
dinnerplates
dinnerplatesint
dinner
popatstackint
cityai
citybi
cutsi
logarithmic
yi1
rectanglei
yi2
133
reverses
minsize
maxletters
text1
text2
directioni
specialty
quantitiesi
retail
catches
bumper
slow
slower
fleets
senders
chat
sendersi
sender
messagesi
chemistry
skilli
newprice
2019-08-16
changedate
universal
warrior
wrr
satisfiability
equality
one-letter
xiyi
xiyihere
wealth
accountsij
score1
score0
score25
3322251
saying
countandsayn-1
count-and-say
countandsay1
countandsayn
poisonous
consume
minutestodie
pigs
minutestotest
survive
2m
maxm
decompress
sublists
sublist
decompressed
k-radius
avgs
avgsi
275
ants
plank
ay1
by1
rectilinear
bx2
by2
ax2
bx1
ay2
ax1
plotting
stockpricesi
stockprices
chart
dayi
om
logm
logn
dth
doctor
advised
noticed
candytypei
candytype
advice
mycircularqueue
dequeue
mycircularqueuek
benefits
enqueueint
xk
batteriesi
recharged
battery
batteries
pages
web
developer
doll
russian
envelopes
envelopesi
envelope
unordered
superstring
subtracted
particularly
diffi
releasetimes0
tester
keyspressedi
releasetimes
keypad
released
releasetimesi
keypresses
keypress
keyspressed
compile
za
warmer
shelf
bookshelf
thickness
thicknessi
books
booksi
shelves
bookcase
shelfwidth
row1i
matxy
queryi
row2i
col2i
col1i
24130
13024
row-traversing
handy
wanted
reshaped
reshape
matlab
randomizedset
lowlimit
highlimit
type-1
type-2
mapsum
sumstring
key-val
overridden
u2
u1
vk
uk
lastly
src2
dest
src1
constituent
conversions
revenue
janfebmaraprmayjunjulaugsepoctnovdec
fxy
callable
findsolution
customfunction
monotonically
functionid
fint
implementations
alicevalues
bobvalues
bobvaluesi
differently
alicevaluesi
harmonious
multiplications
complex
imaginary
i2
realimaginaryi
-100
list1s
ath
bth
compact
earning
lemonade
bills
billsi
divisorsi
wrap-around
min10
cursorleftint
deletetextint
texteditor
cursor
simulating
cursorposition
addtextstring
currenttextlength
cursorrightint
editor
gridin
punishment
librarys
replies
resend
originating
periodically
patiencei
resending
channel
patience
channels
divider
corridor
dividers
decorative
went
observation
observations
fortunately
conveyor
belt
shipped
printing
croaks
croak
croaking
croakoffrogs
y0
212
016
123001212
integerpart
integerpartnonrepeatingpartrepeatingpart
016666
repeatingpart
conventionally
integerpartnonrepeatingpart
1230001
portion
016666666
nonrepeatingpart
xxx-xxx-xxxx
7890
456-7890
xxx-xxxx
987-123-4567
one-liner
xxx
456-7890valid
operands
beautifully
84351
2314
domains
count-paired
cpdomains
subdomains
d1d2
rep
d1d2d3
9001
subdomain
discussleetcodecom
com
implicitly
rstart
cstart
northwest
southeast
crawler
baseball
operationsi
valuediff
indexdiff
pickint
winston
mysterious
funcarr
func
even-odd
acgaattccg
nucleotides
studying
dna
10-letter-long
useful
invalidated
lfucache
lfucacheint
lfu
ramp
inequality
neededtimei
colorful
neededtime
exclusively
cornered
pk
primitive
nonempty
outermost
powersj
laps
tires
lap
tiresi
tire
numlaps
changetime
rix-1
rand7
argument
rand10
millis
sleep
sleeps
treeancestor
getkthancestorint
treeancestorint
largest-valued
factorial10
clumsy
clumsy10
rod
r3g2b1
color-position
1921681312
012201
0011255245
043
pac-man
xtarget
ghostsi
ytarget
ghost
ghosts
early
maxmove
startcolumn
itembrand
joindate
itemid
favoritebrand
buyer
obviously
crossed
minn
temporary
sex
camera
cameras
whitespaces
edits
explode
on2
cube
cubic
storeroom
supervisor
bigger
s4
011100110110001
0111001
reversex
invertx
reverseinvertsi
inverts
one-bit
1-bit
2-bit
1021
countj
pointsj
orderly
concatenates
productkey
tromino
tilings
studentidi
reporti
negativefeedback
feedback
positivefeedback
69
num1num2
greed
gi
cookie
allowedguesses
helper
six-letter-long
reasonable
bruteforce
masterguessword
masterguess
uniques
index-0
marbles
weightsj
marble
rec1
rec2
touch
toeplitz
rent
rents
resj
shopi
dropint
movierentingsystemint
moviei
shopj
renting
moviej
generating
rentint
movierentingsystem
searching
shops
listlistinteger
rental
entriesi
unrented
maxlen
46
trimmedsubarraylength
33344the
trimmedsubarray
3434
trimmed1233344
trimmed312434
1233344
-255
763
ns
-55
even-numbered
countintervals
careful
life
conway
reproduction
wikipedias
under-population
automaton
british
john
interacts
births
over-population
cellular
devised
lives
horton
generation
1970
caused
deaths
mathematician
457
333
opsi
mxy
ops
weather
recorddate
yesterday
suff
wordfilter
fstring
wordfilterstring
spellsi
potion
spells
potions
potionsj
watched
watchedvideos
friendsi
watchedvideosi
general
directly-linked
thief
himself
thievery
abcdefd
dcbaefd
indiceslength
isomorphic
solutionlistnode
consisiting
upperi-1
percent1
upper2
upperi
taxes
taxed
upper1
bracketsi
earned
percent0
upper0
bracketslength
percent2
tax
percenti
createhelloworld
querying
attractiveness
scenic
addstring
sortracker
ordinal
queried
invoked
invocation
statements
truth
statementsii
statementsij
es
aeiou
uaeio
aaaaaaeiiiioou
aaaeeeooo
aeoiu
ratingsi
highest-rated
cuisine
cuisines
foodsi
changeratingstring
foodratingsstring
foodratings
newrating
cuisinesi
highestratedstring
exception
twins
twin
n-1-ith
successively
totaltrips
influence
createcounter
countk
statistics
sample
result1
result0
widths1
widths0
sized
maxbik
bij
numsij
treesj
zero-based
numsnumsi
guessing
travelleddistance
travellers
toggle
blocksi
recolors
recolor
extroverts
introvert
living
introvertscount
happiness
extrovert
introverts
extrovertscount
sizet
numst
resize
resizing
dynamic
designing
items1
reti
items2
ret
vacant
prison
fntxtfncontent
fntxt
fncontent
f1txt
f2txt
f1txtf1content
f2content
directorypathfilenametxt
rootd1d2dm
f1content
f2txtf2content
ti
maxcost
enqueuetimei
processingtimei
act
difficultyi
workerj
solitaire
aar
accelerate
125
0090
0090089
089
9089
joins
flag
primaryflag
fat
recyclable
lowfats
locationsj
locationsi
locationslength
tac
toe
pending
tic
interesting
almost
usage
usa
capitals
google
meanwhile
graphv
graphu
bipartite
basestr
implies
symmetry
reflexivity
transitivity
cde
equivalence
s2i
acd
eed
equivalency
maxvalue
exempted
smooth
descent
2maximumbit
maximumbit
sub-sequence
customernamei
header
tablenumberi
fooditemi
ordersicustomernameitablenumberifooditemi
conver
maxarr0i
converi
src
dst
flightsi
illustrated
orthogonal
12233211
neighborhood
neighborhoods
cool
sound
delightful
exercises
soul
eetcode
employeesiid
employeesisubordinates
employeesiimportance
2251
keytime
doors
emits
keytimei
one-hour
keyname
2351
2352
saves
keynamei
alert
0949
key-cards
key-card
keycard
digit-logs
letter-logs
space-delimited
identifiers
tap
watered
taps
one-dimensional
guardsi
guard
unguarded
obstructed
wallsj
client
2013-10-01
canceled
cancellation
cancelledbyclient
unbanned
clientid
2013-10-03
cancelledbydriver
role
usersid
cityid
requestat
driverid
arrivealice
5-character
leap
31
rome
mm-dd
arrivebob
business
leavealice
leavebob
lastdayi
coursesi
accommodate
alike
579
flength
123456579
left-most
stamped
targetlength
stamp
ml
soup
servings
mls
10n
listb
headb
intersected
retain
skipa
skipb
lista
heada
intersectval
listing
labeling
exceeded
blooms
planttimei
growtime
seeds
bloomed
planttime
blooming
growtimei
buys
nim
heap
battleship
separates
battleships
accepterid
requestaccepted
acceptdate
requesterid
52372
numsliri
majoritycheckerint
majoritychecker
progression
1321
array-form
ys
00010
00001
10010
meal
deliciousness
meals
deliciousnessi
10-6
busiest
loadi
handled
computational
i2th
busy
inversions
global
ensures
validated
targetseconds
finger
microwave
interprets
startat
fatigue
generic
54
pushcost
0954
normalized
99
81
normalizes
cooking
segmented
prefixi
revisit
segmentsi
rightj
rather
mix
246
47
leftj
1412477
paintingj
thin
mixj
145177
advantage
follower
followers
prior
numsik
numsik2
heroes
maxnumsi0
minnumsi0
abaacc
backspacing
editors
chargetimes
runningcosts
sumrunningcosts
charge
chargetimesi
runningcostsi
maxchargetimes
switch
couples
couple
3000000
continent
25000000
countries
km2
bigint
gdp
twenty-five
truncating
pos1z
pos2z
pos1y
pos1x
pos2y
pos2v
pos1v
pos2x
pruning
blockedi
checkin
chronological
railway
stationname
startstation
checkout
endstation
undergroundsystem
checkoutint
getaveragetime
underground
checkinint
getaveragetimestring
arr1i-arr2j
newinterval
minrootleftval
sub-nodes
sub-node
rootrightval
golf
determining
vision
angle2
posy
obstruct
posx
even-valued
grandparent
rowindexth
rowindex
nearly
numslots
pillow
indices0-indexed
numsansi
coprimes
ca
abaca
aca
boat
boats
mycalendar
cuboidsi
heightj
cuboid
cuboids
lengthj
widthj
lengthi
rungs
rung
up-left
enjoyyourcoffee
coffee
enjoy
queuing
rowsumi
rowsumlength
colsumlength
colsumj
rowsum
fulfills
prize
prizepositionsi
prizes
prizepositions
marksi
indistinguishable
counti
typesi
minnums2i0
nums2ik
nums1ik
nums1i0
nums1i1
-y
sentencesi
clip
clips
stitching
lasted
sporting
clipsi
indexs
kids
kid
extracandies
prism
0-height
traversable
states
terminal
eventual
unmarked
pixel
sc
sr
imagesrsc
imageij
multiset
randomizedcollection
linearly
tokensi
gaining
equalize
voyage
interchangeable
widthiheighti
widthjheightj
width-to-height
bcfd
abca
abacba
figures
maxoperations
non-adjacent
directionsi
collided
involved
motion
lockedi
time-points
302
productofnumbersadd2
integerproduct
30254
productofnumbersadd3
productofnumbersadd0
productofnumbersadd4
productofnumbers
nullnullnullnullnullnull20400null32
302548
3025423482
productofnumbersgetproduct3
productofnumbersgetproduct4
productofnumbersgetproduct2
getproductint
getproduct
productofnumbersadd8
overflowing
productofnumbersaddaddaddaddaddgetproductgetproductgetproductaddgetproduct
productofnumbersadd5
3025
mirrored
alone
patients
patientname
patientid
hospital
diab1
diabetes
ps
subtracting
sright
sleft
baggage
puzzlesi
abcdefg
cabbage
faced
beefed
4x
losers
favoritecompanies
favoritecompaniesi
favorites
companies
multiplying
searched
minh
mhts
server-to-server
fortsi
forts
maxij
minij
fortsk
fort
references
hills
valley
hill
valleys
ea
computation
pizzas
153
2i
arrayfilter
booleanvalue
truthy
filteredarr
queriesith
intlength
2582
3245
1-day
costs1
planned
costs0
30-day
7-day
costs2
365
repetitively
non-repeating
assumes
peekingiterator
peeking
peekingiteratoriteratorint
examroom
leaveint
examroomint
sits
4321
2143
4123
greatness
permuting
carpet
triangulation
n-sided
triangulate
wildcard
endtime1
event2
starttime1
endtime2
starttime2
event1
rmove
cmove
unvisited
hourglass
firstword
targetword
secondword
021
gcdnumsi
disappeared
underscore
e-mail
e-mails
ryan
30transpose
reorganize
z2
distancetolastnodex
distancetolastnodezi
zi1
distancetolastnodezi1
z1
zi
z0
zk
haystack
needle
10-13
--xxxx
0-3
masking
masked
---xxxx
somewhere
personal
mask
fixed-width
widest
rj
reformatting
firstly
getstring
setstring
timemap
timestampprev
time-based
tilt
months
prevcoursej
relationsj
nextcoursej
a123bc34d8ef34
variety
inspection
official
001101
streak
hashsub
valz
vala
hashs
pk-1
vals0
hashvalue
vals1
valsk-1
sumnumsi-numsj
heaviest
peoples
sandwichesi
cafeteria
sandwich
sandwiches
lunch
nextvisiti
nextvisit
existence
edgelist
disi
qj
edgelisti
heshe
shifted
revision
revisions
2533
version1
version2
purpose
anticlockwise
1200
quest
spelled
trail
stage
engraved
fallout
keyword
pressing
freedom
door
presuf
presufec
1234589876e5
abbreviate
suf
1234567
pre
1234567654321
546
1234554321
12345678987600000
abbreviating
lastname
combine
firstname
addressid
prototype
arraylast
6141
6174
61741
6741
new2
329
92
93
2932
new1
passingfees
passingfeesj
fees
3-same-digit
suggests
suggestions
suggested
numspivot
37
124789
23489
89
0-thupper
2-row
column0-indexed
1-stlower
colsumi
trusti
town
trust
trusts
rumor
secretly
kitchen
longurl
tiny
tinyurl
shortening
encodestring
encodedecode
decodestring
shorturl
httpsleetcodecomproblemsdesign-tinyurl
companion
httptinyurlcom4e9iak
poeplei
rangemodule
addrangeint
removerangeint
overlaps
tracking
module
queryrangeint
tracked
trains
depart
commute
107
bottles
numexchange
drinking
bottle
drink
numbottles
firstlisti
secondlistj
endj
secondlist
firstlist
hiring
327712
32772
sorts
k-values
3214
pancake
arr0k-1
minima
maxima
maximaminima
mindistance
translate
img2
translated
img1
translation
experienceyears
projectid
totaljumbo
tomatoslices
jumbo
burger
cheeseslices
totalsmall
burgers
tomato
labelling
sixth
registered
contestid
decimals
register
username
leftsumi
rightsumi
adjacentpairsi
adjacentpairs
forgotten
selects
symmetric
finalsum
rapidly
isinfectedij
threatens
modeled
isinfected
quarantine
affected
virus
firstplayer
compete
competes
winners
against
secondplayer
snakes
boustrophedon
destinations
style
mincurr
-14-13
boardn
alal1ar
storekeeper
hole
grapha
graph1
expectation
wagei
wage
qualityi
